In [1]:
import pandas as pd
data1 = pd.Series([10,5,2,2,7], index = ['철수', '영희', '민수','칠성','펩시'])
data1.index.name = '이름'
data1

이름
철수    10
영희     5
민수     2
칠성     2
펩시     7
dtype: int64

# 1. index를 이용해서 철수의 값만 뽑기

In [3]:
data1['철수']

10

In [2]:
data1.loc['철수']

10

# 2. iloc을 이용해서 철수의 값만 뽑기

In [4]:
data1.iloc[0]

10

# 3. index를 이용해서 민수, 펩시의 값 뽑기

In [5]:
a = ['민수', '펩시']
data1[a]

이름
민수    2
펩시    7
dtype: int64

In [6]:
data1.loc[a]

이름
민수    2
펩시    7
dtype: int64

# 4. iloc을 이용해서 민수, 펩시의 값 뽑기

In [7]:
a = [2, 4]
data1.iloc[a]

이름
민수    2
펩시    7
dtype: int64

# 5. index만 뽑아보기

In [8]:
data1.index

Index(['철수', '영희', '민수', '칠성', '펩시'], dtype='object', name='이름')

# 6. value만 뽑아보기

In [9]:
data1.values

array([10,  5,  2,  2,  7])

# 7. value로 정렬하기

In [11]:
sorted(data1)

[2, 2, 5, 7, 10]

In [12]:
sorted(data1.values)

[2, 2, 5, 7, 10]

# 8. index로 정렬하기

In [13]:
sorted(data1.index)

['민수', '영희', '철수', '칠성', '펩시']

# 9. index로 정렬한대로 재정렬하기

In [14]:
data1.reindex(sorted(data1.index))

이름
민수     2
영희     5
철수    10
칠성     2
펩시     7
dtype: int64

# 10. index반대로 정렬하기

In [15]:
new_index = ['칠성','펩시','민수','영희','철수']
data1.reindex(new_index)

이름
칠성     2
펩시     7
민수     2
영희     5
철수    10
dtype: int64

# 11. 데이터 두개 더하기

In [16]:
data2 = pd.Series([1,3,1,5,2], index = ['영희', '민수', '철수','펩시','코카'])
data2

영희    1
민수    3
철수    1
펩시    5
코카    2
dtype: int64

In [17]:
data1 + data2

민수     5.0
영희     6.0
철수    11.0
칠성     NaN
코카     NaN
펩시    12.0
dtype: float64

# 12. 유일한 값만 뽑기

In [19]:
data1.unique()

array([10,  5,  2,  7])

# 13. 사전 데이터로 Series 만들기
+ 금메달 - 10
+ 은메달 - 3
+ 동메달 - 12

In [21]:
medal = {'금메달':10, '은메달':3, '동메달':12}
data3 = pd.Series(medal)
data3

금메달    10
은메달     3
동메달    12
dtype: int64

# 14. 사전 데이터로 DataFrame 만들기
+ 'age' - [23, 41, 62, 9]
+ 'name' - ['벤', '광수', '재석', '종국']
+ 'height' - [152, 190, 178, 185]

In [23]:
runningMan = {'age' : [23,41,62,9],
              'name' : ['벤','광수','재석','종국'],
              'height' : [152,190,178,185]}
data4 = pd.DataFrame(runningMan, columns=['name','age','height'])
data4

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178
3   종국    9     185

# 15. age 컬럼만 출력해보기

In [24]:
data4.age

0    23
1    41
2    62
3     9
Name: age, dtype: int64

# 16. iloc이용해서 2,3 번째 index에 해당하는 데이터만 뽑기

In [25]:
data4.iloc[[1,2]]

  name  age  height
1   광수   41     190
2   재석   62     178

In [26]:
data4.iloc[1:3]

  name  age  height
1   광수   41     190
2   재석   62     178

# 17. iloc 이용해서 2,3번째 column에 해당하는 데이터만 뽑기

In [ ]:
data4.iloc[:,[1,2]]

In [28]:
data4.iloc[:,1:3]

   age  height
0   23     152
1   41     190
2   62     178
3    9     185

# 18. loc 이용해서 2,3 번째 index에 해당하는 데이터만 뽑기

In [29]:
data4.loc[[1,2]]

  name  age  height
1   광수   41     190
2   재석   62     178

# 19. loc 이용해서 2,3번째 column에 해당하는 데이터만 뽑기

In [31]:
data4.loc[:,['age','height']]

   age  height
0   23     152
1   41     190
2   62     178
3    9     185

In [30]:
data4.loc[:,'age':'height']

   age  height
0   23     152
1   41     190
2   62     178
3    9     185

# 20. 위에서부터 데이터 3행만 뽑기

In [32]:
data4.head(3)

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178

# 21. 밑에서부터 데이터 2행만 뽑기

In [33]:
data4.tail(2)

  name  age  height
2   재석   62     178
3   종국    9     185

# 22. bool이용해서 2,3 행만 뽑기

In [35]:
bool_list = [False, True, True, False]
data4[bool_list]

  name  age  height
1   광수   41     190
2   재석   62     178

# 23. bool이용해서 2번째 column의 1,4 행만 뽑기

In [37]:
bool_list = [True, False, False, True]
data4.age[bool_list]

0    23
3     9
Name: age, dtype: int64

# 24. 나이, 키 평균 구하기

In [38]:
data4.mean(axis=0) #sum, max, min

age        33.75
height    176.25
dtype: float64

# 25. 데이터형 float로 바꿔보기

# 26. 키의 데이터형만 float로 바꿔보기

In [44]:
data4.height.astype('float')

0    152.0
1    190.0
2    178.0
3    185.0
Name: height, dtype: float64